app/controllers/pages_controller.rb

  def home
  	success_stories= SuccessStory.all
---
SELECT "success_stories".* FROM "success_stories"