app/controllers/success_stories_controller.rb

  def index
    @success_stories = SuccessStory.all
---
SELECT "success_stories".* FROM "success_stories"

  def create
    @success_story = SuccessStory.new(success_story_params)

    respond_to do |format|
      if @success_story.save
---
INSERT INTO "success_stories" ("photo_url", "title", "description", "date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["photo_url", "asdf"], ["title", "asdf"], ["description", "asdf"], ["date", "asdf"], ["created_at", "2015-03-22 21:29:43.240274"], ["updated_at", "2015-03-22 21:29:43.240274"]]

  def update
    respond_to do |format|
      if @success_story.update(success_story_params)
---
UPDATE "success_stories" SET "description" = $1, "updated_at" = $2 WHERE "success_stories"."id" = $3  [["description", "t\r\n\r\n\r\nt\r\n\r\nt\r\n\r\nt\r\ne\r\ns\r\nt\r\ns\r\n"], ["updated_at", "2015-04-21 23:35:37.006345"], ["id", 26]]

  def destroy
    @success_story.destroy
---
DELETE FROM "success_stories" WHERE "success_stories"."id" = ?  [["id", 1]]

    def set_success_story
      @success_story = SuccessStory.find(params[:id])
---
SELECT  "success_stories".* FROM "success_stories" WHERE "success_stories"."id" = $1 LIMIT 1  [["id", 26]]