app/controllers/volunteers_controller.rb

SELECT "volunteers".* FROM "volunteers"
---
  def index
    @volunteers = Volunteer.all

INSERT INTO "volunteers" ("first_name", "last_name", "address", "city", "state", "postal_code", "country", "telephone", "mobile", "email", "birthday", "position_question", "ec_name", "ec_telephone", "hours_available", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @volunteer = Volunteer.new(volunteer_params)

    respond_to do |format|
      if @volunteer.save

SELECT  "volunteers".* FROM "volunteers" WHERE "volunteers"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_volunteer
      @volunteer = Volunteer.find(params[:id])